src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиПодключений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(Объект.Ссылка.УникальныйИдентификатор()), "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизитВСтрокуПодключения(ИмяРеквизита)

	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	
	Элементы.СтрокаПодключения.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	
	Объект.СтрокаПодключения = Лев(Объект.СтрокаПодключения, НачалоКолонки - 1) + ИмяРеквизита + Прав(Объект.СтрокаПодключения, СтрДлина(Объект.СтрокаПодключения) - НачалоКолонки + 1);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательДобавитьВСтроку(Команда)
	
	ИмяРеквизита = """ + НастройкаПодключения.Пользователь + """;
	
	ДобавитьРеквизитВСтрокуПодключения(ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольДобавитьВСтроку(Команда)
	
	ИмяРеквизита = """ + НастройкаПодключения.Пароль + """;
	
	ДобавитьРеквизитВСтрокуПодключения(ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияДобавитьВСтроку(Команда)
	
	ИмяРеквизита = "СтрокаПодключения";
	
	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	
	Элементы.КодПодключения.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	
	ИзменяемаяСтрока = СтрПолучитьСтроку(Объект.КодПодключения, НачалоСтроки);
	
	ИзменяемаяСтрока = Лев(ИзменяемаяСтрока, НачалоКолонки - 1) + ИмяРеквизита + Прав(ИзменяемаяСтрока, СтрДлина(ИзменяемаяСтрока) - НачалоКолонки + 1);
	
	НоваяСтрока = "";
	Для Счетчик = 1 По СтрЧислоСтрок(Объект.КодПодключения) Цикл
		
		НоваяСтрока = НоваяСтрока + ?(ЗначениеЗаполнено(НоваяСтрока), Символы.ПС, "");
		
		Если Счетчик = НачалоСтроки Тогда
			НоваяСтрока = НоваяСтрока + ИзменяемаяСтрока;
		Иначе
			НоваяСтрока = НоваяСтрока + СтрПолучитьСтроку(Объект.КодПодключения, Счетчик);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Объект.КодПодключения = НоваяСтрока;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура СохранитьПароль(Владелец, НовыйПароль)

	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Строка(Владелец.УникальныйИдентификатор()), НовыйПароль, "Пароль");
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	СтрокаОшибок = ПроверитьСоединениеНаСервере(Объект.Ссылка);
	
	Если СтрокаОшибок = "" Тогда
		Сообщить("Соединение успешно установлено");
	Иначе
		Сообщить(СтрокаОшибок);
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПроверитьСоединениеНаСервере(ОбъектСсылка)
	
	СтруктураСоединения = Справочники.МС_НастройкиПодключений.ПолучитьСоединение(ОбъектСсылка);
	
	Возврат СтруктураСоединения.СтрокаОшибок;
	
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СохранитьПароль(ТекущийОбъект.Ссылка, Пароль)
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	Иначе
		Для каждого РезультатВыбора Из Результат Цикл
			Объект[Параметры] = РезультатВыбора;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры
